In [1]:
import pandas as pd
import numpy as np

In [2]:
train_data=pd.read_csv("E:/Data_Science/analytics_vidya/LTFS_business_forecast/train.csv")
test_data=pd.read_csv("E:/Data_Science/analytics_vidya/LTFS_business_forecast/test.csv")

In [3]:
test_data[test_data['segment']==2].shape

(93, 3)

In [4]:
test_data[test_data['segment']==2]['application_date'].nunique()

93

In [5]:
train_data.head()

  application_date  segment  branch_id        state  zone  case_count
0       2017-04-01        1        1.0  WEST BENGAL  EAST        40.0
1       2017-04-03        1        1.0  WEST BENGAL  EAST         5.0
2       2017-04-04        1        1.0  WEST BENGAL  EAST         4.0
3       2017-04-05        1        1.0  WEST BENGAL  EAST       113.0
4       2017-04-07        1        1.0  WEST BENGAL  EAST        76.0

In [8]:
df=train_data[train_data['segment']==2].groupby(['application_date'])[['case_count']].sum()
df.to_csv('time_segment_2.csv')
df.head()

                  case_count
application_date
2017-04-01             897.0
2017-04-02             605.0
2017-04-03            2016.0
2017-04-04            2245.0
2017-04-05            2415.0

In [82]:
df=train_data[train_data['segment']==2].groupby(['application_date'])[['case_count']].sum()
df.to_csv('time_segment_2.csv')
df.head()

                  case_count
application_date
2017-04-01             897.0
2017-04-02             605.0
2017-04-03            2016.0
2017-04-04            2245.0
2017-04-05            2415.0

In [86]:
test_data[test_data['segment']==2].tail()

      id application_date  segment
175  176       2019-10-20        2
176  177       2019-10-21        2
177  178       2019-10-22        2
178  179       2019-10-23        2
179  180       2019-10-24        2

In [48]:
train_data['branch_id'].unique()

array([  1.,   3.,   5.,   7.,   8.,   9.,  10.,  11.,  13.,  14.,  15.,
        16.,  17.,  18.,  19.,  20.,  21.,  29.,  34.,  35.,  36.,  42.,
        43.,  48.,  61.,  62.,  63.,  64.,  65.,  66.,  67.,  68.,  69.,
        70.,  72.,  73.,  74.,  76.,  77.,  78.,  79.,  82.,  84.,  85.,
       100., 101., 103., 104., 105., 111., 117., 120., 121., 135., 136.,
       137., 147., 159., 165., 202., 207., 217., 248., 249., 250., 251.,
       254., 255., 257., 258., 259., 260., 261., 262., 263., 264., 265.,
       266., 267., 268., 269., 270., 271.,  nan])

In [5]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80402 entries, 0 to 80401
Data columns (total 6 columns):
application_date    80402 non-null object
segment             80402 non-null int64
branch_id           66898 non-null float64
state               80402 non-null object
zone                66898 non-null object
case_count          80402 non-null float64
dtypes: float64(2), int64(1), object(3)
memory usage: 3.7+ MB

In [6]:
train_data.shape

(80402, 6)

In [7]:
train_data.isnull().sum()

application_date        0
segment                 0
branch_id           13504
state                   0
zone                13504
case_count              0
dtype: int64

In [52]:
df=pd.DataFrame(train_data.groupby(['state'])['zone'].apply(list))
for i in range(len(df)):
    df['zone'].iloc[i]=list(set(df['zone'].iloc[i]))[-1]
df.reset_index()

             state     zone
0   ANDHRA PRADESH    SOUTH
1            ASSAM     EAST
2            BIHAR     EAST
3     CHHATTISGARH  CENTRAL
4            DELHI    NORTH
5          GUJARAT     WEST
6          HARYANA    NORTH
7        JHARKHAND    SOUTH
8        KARNATAKA    SOUTH
9           KERALA    SOUTH
10  MADHYA PRADESH  CENTRAL
11     MAHARASHTRA     WEST
12          ORISSA     EAST
13          PUNJAB    NORTH
14      TAMIL NADU    SOUTH
15       TELANGANA    SOUTH
16         TRIPURA     EAST
17   UTTAR PRADESH     EAST
18     UTTARAKHAND     EAST
19     WEST BENGAL     EAST

In [64]:
df2=pd.DataFrame(train_data.groupby(['state'])['branch_id'].apply(list))
for i in range(len(df2)):
    df2['branch_id'].iloc[i]=list(set(df2['branch_id'].iloc[i]))
df2=df2.reset_index()
df2

             state                                          branch_id
0   ANDHRA PRADESH           [66.0, 263.0, 265.0, 267.0, 111.0, 17.0]
1            ASSAM  [nan, nan, nan, nan, nan, nan, nan, nan, nan, ...
2            BIHAR  [nan, nan, nan, nan, nan, nan, nan, nan, nan, ...
3     CHHATTISGARH  [nan, nan, nan, nan, nan, nan, nan, nan, nan, ...
4            DELHI                                              [3.0]
5          GUJARAT  [nan, nan, nan, nan, nan, nan, nan, nan, nan, ...
6          HARYANA  [nan, nan, nan, nan, nan, nan, nan, nan, nan, ...
7        JHARKHAND  [nan, nan, nan, nan, nan, nan, nan, nan, nan, ...
8        KARNATAKA  [nan, nan, nan, nan, nan, 5.0, nan, nan, nan, ...
9           KERALA  [nan, nan, nan, nan, nan, nan, nan, nan, nan, ...
10  MADHYA PRADESH  [nan, nan, nan, nan, nan, nan, nan, nan, nan, ...
11     MAHARASHTRA  [nan, nan, nan, nan, nan, nan, nan, nan, nan, ...
12          ORISSA  [nan, nan, nan, nan, nan, nan, nan, nan, nan, ...
13          PUNJAB  [nan, nan, nan, nan, nan, nan, nan, nan, nan, ...
14      TAMIL NADU  [nan, nan, nan, nan, nan, nan, nan, nan, nan, ...
15       TELANGANA                                      [16.0, 266.0]
16         TRIPURA  [nan, nan, nan, nan, nan, nan, nan, nan, nan, ...
17   UTTAR PRADESH  [nan, nan, nan, nan, nan, nan, nan, nan, nan, ...
18     UTTARAKHAND                                      [202.0, 79.0]
19     WEST BENGAL  [nan, 1.0, nan, nan, nan, nan, nan, 7.0, 8.0, ...